app/views/despesas/_form.html.erb

        <% if @despesa.gastos? %>
          <% readonly = @despesa.orcamento_id.present? %>
---
SELECT "orcamentos".* FROM "orcamentos"