app/helpers/forma_pagamentos_helper.rb

  def formas_de_pagamento
    @unidade_familiar.usuarios.includes(:forma_pagamentos).each_with_object({}) do |usuario, hash|
      opcoes = usuario.forma_pagamentos.map do |fp|
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."unidade_familiar_id" = 1
SELECT "forma_pagamentos".* FROM "forma_pagamentos" WHERE "forma_pagamentos"."usuario_id" IN (1, 2, 3)