app/helpers/orcamentos_helper.rb

  def descricao_orcamentos
    @unidade_familiar.orcamentos.pluck(:categoria, :id)
---
SELECT "orcamentos"."categoria", "orcamentos"."id" FROM "orcamentos" WHERE "orcamentos"."unidade_familiar_id" = 1