app/views/usuarios/_usuario.html.erb

      <hr>
      <% usuario.forma_pagamentos&.each do |forma_pagamento| %>
---
SELECT "forma_pagamentos".* FROM "forma_pagamentos" WHERE "forma_pagamentos"."usuario_id" = 1