app/views/usuarios/index.html.erb

SELECT SUM("receitas"."valor") FROM "receitas" WHERE "receitas"."usuario_id" = 1
---
            <td><%= usuario.receber_alerta? ? 'Sim' : 'Não' %></td>
            <td>R$ <%= usuario.receitas&.sum(:valor) %></td>