app/controllers/administrativo_controller.rb

  def index
    @ultimas_despesas_lancadas = @unidade_familiar.despesas.where(categoria: 'gastos').limit(8)
    @ultimas_contas_lancadas = @unidade_familiar.despesas.where(categoria: 'contas').limit(8)
    @usuarios_ativos = @unidade_familiar&.usuarios.where(status: 'ativo')

    @total_receitas = @usuarios_ativos&.joins(:receitas).sum("receitas.valor")
    @orcamentos = @unidade_familiar.orcamentos&.includes(:despesas)
---
SELECT "despesas".* FROM "despesas" WHERE "despesas"."unidade_familiar_id" = 1 AND "despesas"."categoria" = 2 LIMIT 8
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."unidade_familiar_id" = 1 AND "usuarios"."status" = 1 LIMIT 11
SELECT SUM("receitas"."valor") FROM "usuarios" INNER JOIN "receitas" ON "receitas"."usuario_id" = "usuarios"."id" WHERE "usuarios"."unidade_familiar_id" = 1 AND "usuarios"."status" = 1
SELECT "despesas".* FROM "despesas" WHERE "despesas"."orcamento_id" IN (1, 2, 3, 4, 5, 6)
SELECT "orcamentos".* FROM "orcamentos" WHERE "orcamentos"."unidade_familiar_id" = 1 LIMIT 11