app/controllers/despesas_controller.rb

  def new
    @despesa = Despesa.new
    @despesa.orcamento_id = params[:orcamento].to_i if params[:orcamento].present?
---
SELECT "despesas".* FROM "despesas" WHERE "despesas"."orcamento_id" = 1
SELECT "orcamentos".* FROM "orcamentos"