app/controllers/despesas_controller.rb

  def index
    @despesas = Despesa.all
---
SELECT "despesas".* FROM "despesas"

  def create
    @despesa = Despesa.new(despesa_params)
    @despesa.unidade_familiar = @unidade_familiar

    respond_to do |format|
      if @despesa.save
---
INSERT INTO "despesas" ("orcamento_id", "forma_pagamento_id", "descricao", "categoria", "data_gasto", "valor", "status", "quantidade_parcelas", "parcela_atual", "dia_vencimento", "data_vencimento", "alertar_vencimento", "created_at", "updated_at", "unidade_familiar_id") VALUES (4, 1, 'Viagem para Ji-Paraná, ida e volta.', NULL, '2025-04-04', 600.96, NULL, NULL, NULL, NULL, NULL, NULL, '2025-04-04 11:33:37.584115', '2025-04-04 11:33:37.584115', 1) RETURNING "id"

    def set_despesa
      @despesa = Despesa.find(params[:id])
---
SELECT "despesas".* FROM "despesas" WHERE "despesas"."id" = 3 LIMIT 1