app/controllers/forma_pagamentos_controller.rb

  def index
    @forma_pagamentos = FormaPagamento.all
---
SELECT "forma_pagamentos".* FROM "forma_pagamentos"

  def create
    @forma_pagamento = FormaPagamento.new(forma_pagamento_params)

    respond_to do |format|
      if @forma_pagamento.save
---
INSERT INTO "forma_pagamentos" ("usuario_id", "nome", "tipo", "vencimento_fatura_old", "fechamento_fatura_old", "status", "categoria", "created_at", "updated_at", "dia_vencimento_fatura", "melhor_dia_compra") VALUES (1, 'NuBank', 3, NULL, NULL, 0, NULL, '2025-04-04 16:37:39.227074', '2025-04-04 16:37:39.227074', NULL, NULL) RETURNING "id"

    def set_forma_pagamento
      @forma_pagamento = FormaPagamento.find(params[:id])
---
SELECT "forma_pagamentos".* FROM "forma_pagamentos" WHERE "forma_pagamentos"."id" = 1 LIMIT 1