app/controllers/orcamentos_controller.rb

SELECT "orcamentos".* FROM "orcamentos"
---
  def index
    @orcamentos = Orcamento.all

INSERT INTO "orcamentos" ("unidade_familiar_id", "categoria", "status", "descricao", "valorEstimado", "created_at", "updated_at") VALUES (1, 'Teste', 1, 'teste 2', 100.0, '2025-03-28 16:39:24.692193', '2025-03-28 16:39:24.692193') RETURNING "id"
---
  def create
    @orcamento = Orcamento.new(orcamento_params)

    respond_to do |format|
      if @orcamento.save

SELECT "orcamentos".* FROM "orcamentos" WHERE "orcamentos"."id" = 1 LIMIT 1
---
    def set_orcamento
      @orcamento = Orcamento.find(params[:id])