app/controllers/receitas_controller.rb

SELECT "receitas".* FROM "receitas"
---
  def index
    @receitas = Receita.all

INSERT INTO "receitas" ("usuario_id", "valor", "descricao", "dataEntrada", "dataEncerramento", "created_at", "updated_at") VALUES (1, 1500.0, 'Salário mensal', '2022-03-01', '2025-04-01', '2025-04-01 14:07:17.791722', '2025-04-01 14:07:17.791722') RETURNING "id"
---
  def create
    @receita = Receita.new(receita_params)

    respond_to do |format|
      if @receita.save

SELECT "receitas".* FROM "receitas" WHERE "receitas"."id" = 1 LIMIT 1
---
  def set_receita
    @receita = Receita.find(params[:id])