app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)
    @usuario.unidade_familiar = UnidadeFamiliar.first #ajustar

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("unidade_familiar_id", "nome", "email", "senha", "status", "perfil", "receber_alerta", "created_at", "updated_at") VALUES (1, 'Maria Silva', 'maria@gmail.com', '123', 1, 1, 1, '2025-03-31 14:24:20.455142', '2025-03-31 14:24:20.455142') RETURNING "id"

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "status" = 2, "updated_at" = '2025-03-31 14:29:31.558149' WHERE "usuarios"."id" = 3

  def destroy
    @usuario.destroy!
---
DELETE FROM "usuarios" WHERE "usuarios"."id" = 1